-----------------------------------------------------------
-- Функция для определения горячих клавиш
-----------------------------------------------------------
local function map(mode, lhs, rhs, opts)
  local options = { noremap = true, silent = true }
  if opts then
    options = vim.tbl_extend('force', options, opts)
  end
  vim.api.nvim_set_keymap(mode, lhs, rhs, options)
end


-----------------------------------------------------------
-- Файловый менеджер
-----------------------------------------------------------

map("n", "<Leader>n", ":NvimTreeToggle<CR>")

-----------------------------------------------------------
-- Быстрое сохранение
-----------------------------------------------------------
map("n", "<Leader>w", ":w<CR>")
map('i', '<leader>w', '<C-c>:w<CR>')
map('i', 'jj', '<Esc>')

-----------------------------------------------------------
-- Более простое переключение между вкладками
-----------------------------------------------------------
map("n", "<C-j>", "<C-W>j")
map("n", "<C-k>", "<C-W>k")
map("n", "<C-h>", "<C-W>h")
map("n", "<C-l>", "<C-W>l")

-----------------------------------------------------------
-- Отключаем клавиши со стрелками
-----------------------------------------------------------
map('', '<up>', '<nop>')
map('', '<down>', '<nop>')
map('', '<left>', '<nop>')
map('', '<right>', '<nop>')

-----------------------------------------------------------
-- Не показывать тупое окно с последними командами
-----------------------------------------------------------
map('', 'q:', ':q')


-----------------------------------------------------------
-- Настройки Telescope
-----------------------------------------------------------
map('n', '<leader>ff', '<cmd>Telescope find_files<cr>')
map('n', '<leader>fg', '<cmd>Telescope live_grep<cr>')
map('n', '<leader>fb', '<cmd>Telescope buffers<cr>')


-----------------------------------------------------------
-- Переключение между табами
-----------------------------------------------------------
map('', '<leader>tn', ':tabnext<CR>')
map('', '<leader>tp', ':tabprev<CR>')


